#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.this must be replaced
-/+ resource "azurerm_kubernetes_cluster" "this" {
      ~ api_server_authorized_ip_ranges     = [] -> (known after apply)
      - azure_policy_enabled                = false -> null
      ~ current_kubernetes_version          = "1.28.5" -> (known after apply)
      - custom_ca_trust_certificates_base64 = [] -> null
      - enable_pod_security_policy          = false -> null
      ~ fqdn                                = "single-aks-s1t5230c.hcp.westeurope.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      ~ kubernetes_version                  = "1.28.5" -> (known after apply)
      - local_account_disabled              = false -> null
      ~ location                            = "westeurope" -> "northcentralus" # forces replacement
        name                                = "SINGLE_AKS"
      ~ node_resource_group                 = "MC_SINGLE_AKS_MY_RG_SINGLE_AKS_westeurope" -> (known after apply)
      ~ node_resource_group_id              = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/MC_SINGLE_AKS_MY_RG_SINGLE_AKS_westeurope" -> (known after apply)
      - oidc_issuer_enabled                 = false -> null
      + oidc_issuer_url                     = (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "single-aks-s1t5230c.portal.hcp.westeurope.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      - tags                                = {} -> null
        # (16 unchanged attributes hidden)

      ~ default_node_pool {
          - custom_ca_trust_enabled       = false -> null
          - enable_auto_scaling           = false -> null
          - enable_host_encryption        = false -> null
          - enable_node_public_ip         = false -> null
          - fips_enabled                  = false -> null
          ~ kubelet_disk_type             = "OS" -> (known after apply)
          - max_count                     = 0 -> null
          ~ max_pods                      = 110 -> (known after apply)
          - min_count                     = 0 -> null
            name                          = "default"
          ~ node_labels                   = {} -> (known after apply)
          - node_taints                   = [] -> null
          - only_critical_addons_enabled  = false -> null
          ~ orchestrator_version          = "1.28.5" -> (known after apply)
          ~ os_disk_size_gb               = 128 -> (known after apply)
          ~ os_sku                        = "Ubuntu" -> (known after apply)
          - tags                          = {} -> null
          + workload_runtime              = (known after apply)
          - zones                         = [] -> null
            # (16 unchanged attributes hidden)

          - upgrade_settings {
              - max_surge = "10%" -> null
            }
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "ef9dcae2-19b1-4cc9-8ba6-e9ec81ec3c9b" -> (known after apply)
          ~ tenant_id    = "a8119a0b-2409-4589-8670-9419e8dbc7f9" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - kubelet_identity {
          - client_id                 = "d423e451-6935-489c-84b7-34f382223d5d" -> null
          - object_id                 = "7142e6e5-fb45-449a-a600-60fd9f08dbf9" -> null
          - user_assigned_identity_id = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/MC_SINGLE_AKS_MY_RG_SINGLE_AKS_westeurope/providers/Microsoft.ManagedIdentity/userAssignedIdentities/SINGLE_AKS-agentpool" -> null
        }

      - network_profile {
          - dns_service_ip      = "10.0.0.10" -> null
          - ip_versions         = [
              - "IPv4",
            ] -> null
          - load_balancer_sku   = "standard" -> null
          - network_plugin      = "kubenet" -> null
          - outbound_type       = "loadBalancer" -> null
          - pod_cidr            = "10.244.0.0/16" -> null
          - pod_cidrs           = [
              - "10.244.0.0/16",
            ] -> null
          - service_cidr        = "10.0.0.0/16" -> null
          - service_cidrs       = [
              - "10.0.0.0/16",
            ] -> null
            # (5 unchanged attributes hidden)

          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/MC_SINGLE_AKS_MY_RG_SINGLE_AKS_westeurope/providers/Microsoft.Network/publicIPAddresses/55c2d30b-d4af-46f0-a03f-13087e872b19",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }
        }
    }

  # azurerm_kubernetes_cluster_extension.this must be replaced
-/+ resource "azurerm_kubernetes_cluster_extension" "this" {
      ~ aks_assigned_identity            = [
          - {
              - principal_id = "9b637eb9-2b81-4eff-81ad-3fc77e1c0452"
              - type         = "SystemAssigned"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ cluster_id                       = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS" # forces replacement -> (known after apply) # forces replacement
      - configuration_protected_settings = {} -> null
      - configuration_settings           = {} -> null
      ~ current_version                  = "1.8.3" -> (known after apply)
      ~ id                               = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS/providers/Microsoft.KubernetesConfiguration/extensions/flux" -> (known after apply)
        name                             = "flux"
      ~ release_namespace                = "flux-system" -> (known after apply)
      ~ release_train                    = "Stable" -> (known after apply)
      + target_namespace                 = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_kubernetes_flux_configuration.this must be replaced
-/+ resource "azurerm_kubernetes_flux_configuration" "this" {
      ~ cluster_id                        = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS" # forces replacement -> (known after apply) # forces replacement
      ~ id                                = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/bootstrap" -> (known after apply)
        name                              = "bootstrap"
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @iscahomd, Action: `pull_request`, Workflow: `Terraform`*